const schedule = {
    Понеділок: {
        1: "Основи роботи з нейронними мережами",
        2: "Англійська мова",
        3: "Критичне мислення",
    },
    Вівторок: {
        1: "Англійська мова",
        2: "Основи програмування",
        3: "Математичний аналіз",
    },
    Середа: {
        1: "Українська мова",
        2: "Інформаційно-комунікаційні технології",
        3: "Інформаційно-комунікаційні технології",
    },
    Четвер: {
        1: "Математичний аналіз",
        2: "Англійська мова",
        3: "Критичне мислення",
    },
    Пʼятниця: {
        1: "Інформаційно-комунікаційні технології",
        2: "Українська мова",
        3: "Основи роботи з нейронними мережами",
    },
};

function printDaySchedule(day, lessons) {
    console.log(`${day}:`);
    for (let lesson in lessons) {
        console.log(`Пара ${lesson}: ${lessons[lesson]}`);
    }
    console.log();
}

for (let day in schedule) {
    printDaySchedule(day, schedule[day]);
}